# UnableToTransferAttachedGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToTransferAttachedGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to load attached group [Type Name] of model group [Type Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToTransferAttachedGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToTransferAttachedGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToTransferAttachedGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace